app/views/students/dashboard.html.erb

      <div class="notification-status">
        You have <strong><%= @student.notifications.count %></strong> notifications.
      </div>
---
SELECT COUNT(*) FROM "notifications" WHERE "notifications"."student_id" = 980190963

        <%= link_to "Profile", student_profile_path(@student), class: "green-button" %>
        <%= link_to "Notifications (#{@student.notifications.count})", notifications_path, class: "green-button" %>
---
SELECT COUNT(*) FROM "notifications" WHERE "notifications"."student_id" = 980190963