app/helpers/courses_helper.rb

SELECT "user_schedules".* FROM "user_schedules" WHERE "user_schedules"."student_id" = 980190963 AND "user_schedules"."course_id" = 40001 LIMIT 1
---
    def enrollment_status_for(course)
      return nil unless current_student
      current_student.user_schedules.find_by(course_id: course.CRN)&.status