app/controllers/admins_controller.rb

SELECT "courses".* FROM "courses"
---
    def admins_dashboard
      @courses = Course.all