app/controllers/application_controller.rb

  def current_student
    @current_student ||= Student.find_by(id: session[:student_id])
---
SELECT "students".* FROM "students" WHERE "students"."id" = 980190963 LIMIT 1