app/controllers/courses_controller.rb

SELECT "students".* FROM "students" WHERE "students"."id" = 980190967 LIMIT 1
SELECT "user_schedules".* FROM "user_schedules" WHERE "user_schedules"."student_id" = 980190967 AND "user_schedules"."course_id" = 101 LIMIT 1
UPDATE "user_schedules" SET "status" = 'Enrolled', "updated_at" = '2025-04-02 18:17:41.831434' WHERE "user_schedules"."id" = 980191011
---
    def enroll
      course = Course.find(params[:id])
      current_student = Student.find(session[:student_id])  # Ensure user is logged in

      # Check if the student is already enrolled in the course
      if current_student.courses.include?(course)
        flash[:notice] = "You're already enrolled in this course!"
      else
        # Enroll the student in the course
        current_student.courses << course
        # Optionally, set status if you need to manually insert the status in the join table
        user_schedule = current_student.user_schedules.find_by(course: course)
        user_schedule.update(status: "Planned") if user_schedule