app/controllers/courses_controller.rb

  def index
    @term = params[:term] # get the term from URL params
    @courses = Course.all

    # Filter by selected term
    @courses = @courses.where(term: @term) if @term.present?

    # Search filter
    if params[:search].present?
      search_term = "%#{params[:search].downcase}%"
      @courses = @courses.where("LOWER(class_name) LIKE ?", search_term)
    end

    # Recommended courses filter
    if params[:recommended] == "true" && current_student
      @courses = @courses.where(major: current_student.major)
    end

    # Filter for days of the week
    if params[:day].present?
      day_param = params[:day].downcase

      case day_param
      when "mon"
        @courses = @courses.where(mon: true)
      when "tue"
        @courses = @courses.where(tue: true)
      when "wed"
        @courses = @courses.where(wed: true)
      when "thu"
        @courses = @courses.where(thu: true)
---
SELECT "courses".* FROM "courses" WHERE (LOWER(class_name) LIKE '%database design%')
SELECT "courses".* FROM "courses" WHERE "courses"."term" = 'Summer 2025' AND (volume < capacity)
SELECT "courses".* FROM "courses" WHERE "courses"."term" = 'Summer 2025' AND "courses"."major" IS NULL AND (volume < capacity)
SELECT "courses".* FROM "courses" WHERE "courses"."major" IS NULL AND "courses"."mon" = 1
SELECT "courses".* FROM "courses" WHERE "courses"."tue" = 1
SELECT "courses".* FROM "courses" WHERE "courses"."wed" = 1
SELECT "courses".* FROM "courses" WHERE "courses"."thu" = 1

  def enroll
    course = Course.find(params[:id])
    current_student = Student.find(session[:student_id]) # Ensure user is logged in

    # Check if the student is already enrolled
    if current_student.courses.include?(course)
      flash[:notice] = "You're already enrolled in this course!"
      redirect_to courses_path(term: course.term) and return
    end

    # Check if the course has a prerequisite
    if course.prerequisite.present?
      # Get all completed courses for the student
      completed_courses = current_student.user_schedules.where(status: "Planned").pluck(:course_id)

      # Ensure the prerequisite course is completed
      prerequisite_course = Course.find_by(class_name: course.prerequisite)
      if prerequisite_course && !completed_courses.include?(prerequisite_course.id)
        flash[:alert] = "You cannot enroll in #{course.class_name} because you have not completed the prerequisite: #{course.prerequisite}."
        redirect_to courses_path(term: course.term) and return
      end
    end

    # Enroll the student by creating a new UserSchedule entry
    UserSchedule.create!(
      student_id: current_student.id,
      course_id: course.id,
      term: course.term,
      status: "Planned"
    )

    course.increment!(:volume)
---
SELECT "students".* FROM "students" WHERE "students"."id" = 980190966 LIMIT 1
SELECT "students".* FROM "students" WHERE "students"."id" = 980190963 LIMIT 1
SELECT "courses".* FROM "courses" WHERE "courses"."term" = 'Summer 2025'
SELECT "user_schedules"."course_id" FROM "user_schedules" WHERE "user_schedules"."student_id" = 980190966 AND "user_schedules"."status" = 'Planned'
SELECT "courses".* FROM "courses" WHERE "courses"."class_name" = 'None' LIMIT 1
SELECT "user_schedules"."course_id" FROM "user_schedules" WHERE "user_schedules"."student_id" = 980190963 AND "user_schedules"."status" = 'Planned'
INSERT INTO "courses" ("CRN", "class_name", "professor", "term", "credits", "class_time", "created_at", "updated_at", "major", "status", "prerequisite") VALUES (1111111, 'UX Design', 'Dr Holloman', 'Spring 2024', 3, '2000-01-01 11:00:00', '2025-04-06 17:54:05.213159', '2025-04-06 17:54:05.213159', 'Computer Science', 'Open', 'Operating Systems') RETURNING "CRN"
INSERT INTO "user_schedules" ("student_id", "course_id", "status", "created_at", "updated_at", "term") VALUES (980190963, 40003, 'Planned', '2025-04-15 21:16:52.303405', '2025-04-15 21:16:52.303405', 'Summer 2025') RETURNING "id"
UPDATE "courses" SET "volume" = COALESCE("volume", 0) + 1 WHERE "courses"."CRN" = 40001

  def unenroll
    course = Course.find(params[:id])
    current_student.courses.delete(course)


    course.decrement!(:volume) if course.volume > 0
---
UPDATE "courses" SET "volume" = COALESCE("volume", 0) - 1 WHERE "courses"."CRN" = 40001

  def create
    @course = Course.new(course_params)
    if @course.save
---
INSERT INTO "courses" ("CRN", "class_name", "professor", "term", "credits", "class_time", "created_at", "updated_at", "major", "status", "prerequisite", "mon", "tue", "wed", "thu", "fri", "end_time", "volume", "capacity") VALUES (1234123, 'UX Design', 'Dr. Bob Johnson', 'Spring 2024', 3, '2000-01-01 11:00:00', '2025-04-15 20:05:09.063605', '2025-04-15 20:05:09.063605', 'Computer Science', 'Open', 'None', 0, 0, 0, 0, 0, '2000-01-01 12:00:00', 0, 45) RETURNING "CRN"

  def update
    if @course.update(course_params)
---
UPDATE "courses" SET "updated_at" = '2025-04-15 21:01:54.775059', "end_time" = '2000-01-01 12:00:00', "capacity" = 1 WHERE "courses"."CRN" = 40001

  def send_notification_to_all_users(course, action:)
    message = case action
    when "created"
      "New course created: #{course.class_name}"
    when "updated"
      "Course updated: #{course.class_name}"
    else
      "Course #{course.class_name} has been #{action}"
    end

    Student.where(major: course.major).find_each do |student|
      Notification.create!(student: student, message: message)
      # Use the attribute accessor (student[:notifications]) to get the DB column value,
      # then update it directly to avoid conflict with the association.
      new_count = student[:notifications].to_i + 1
      student.update_column(:notifications, new_count)
---
SELECT "students".* FROM "students" WHERE "students"."major" = 'Computer Science' ORDER BY "students"."id" ASC LIMIT 1000
INSERT INTO "notifications" ("student_id", "message", "read", "created_at", "updated_at", "title", "body") VALUES (980190966, 'Course updated: Intro to Cybersecurity', 0, '2025-04-15 21:01:54.790547', '2025-04-15 21:01:54.790547', NULL, NULL) RETURNING "id"
UPDATE "students" SET "notifications" = 9 WHERE "students"."id" = 980190966