app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)
    if @course.save
---
INSERT INTO "courses" ("CRN", "class_name", "professor", "term", "credits", "class_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "CRN"

  def update
    if @course.update(course_params)
---
UPDATE "courses" SET "class_name" = ?, "updated_at" = ? WHERE "courses"."CRN" = ?  [["class_name", "Updated Course"], ["updated_at", "2025-03-25 19:37:16.961085"], ["CRN", 101]]