app/controllers/schedule_view_controller.rb

SELECT "students".* FROM "students" ORDER BY "students"."id" ASC LIMIT 1
SELECT "courses".* FROM "courses"
SELECT "students".* FROM "students" WHERE "students"."id" = 980190964 LIMIT 1
SELECT "courses".* FROM "courses" INNER JOIN "user_schedules" ON "courses"."CRN" = "user_schedules"."course_id" WHERE "user_schedules"."student_id" = 980190964
SELECT "user_schedules".* FROM "user_schedules" WHERE "user_schedules"."student_id" = 980190969
---
  def index
    # TODO - Add user from session not fixed
    @student = Student.first

    @term = Course.first&.term || "N/A"

    @student = Student.find(session[:student_id])  # Ensure the student is found

    @enrolled_courses = @student.courses  # Fetch enrolled courses

    @user_schedules = @student.user_schedules.includes(:course)