app/controllers/schedule_view_controller.rb

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 298486374], ["LIMIT", 1]]
---
  def create
    student = Student.find(session[:student_id])