app/controllers/schedule_view_controller.rb

SELECT "students".* FROM "students" ORDER BY "students"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "user_schedules" ("student_id", "course_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["student_id", 298486374], ["course_id", 102], ["status", nil], ["created_at", "2025-03-25 19:37:17.028125"], ["updated_at", "2025-03-25 19:37:17.028125"]]
---
  def create
    # Grab student and course_Id
    student = Student.first
    course_id = params[:course_id]

    # Create a new record joining the two values
    UserSchedule.create!(student_id: student.id, course_id: course_id)

SELECT "user_schedules".* FROM "user_schedules" WHERE "user_schedules"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
DELETE FROM "user_schedules" WHERE "user_schedules"."id" = ?  [["id", 980190962]]
---
  def destroy
    user_schedule = UserSchedule.find(params[:id])
    user_schedule.destroy