app/controllers/sessions_controller.rb

SELECT "students".* FROM "students" WHERE "students"."email" = 'carlos@admin.com' LIMIT 1
SELECT "admins".* FROM "admins" WHERE "admins"."email" = 'carlos@admin.com' LIMIT 1
---
  def create
    # Try to log in as student first
    student = Student.find_by(email: params[:email])
    if student&.authenticate(params[:password])
      session[:student_id] = student.id
      redirect_to dashboard_path and return
    end

    # Try to log in as admin next
    admin = Admin.find_by(email: params[:email])