app/controllers/students_controller.rb

SELECT "students".* FROM "students" WHERE "students"."id" = 980190963 LIMIT 1
---
  def dashboard
    @student = Student.find(session[:student_id])

INSERT INTO "students" ("email", "name", "password_digest", "credits_earned", "created_at", "updated_at", "major") VALUES ('pat@pat.com', 'pat', '$2a$12$iU0u9vCB9u4o92gyx3D4H.vdTW781I0Ge8p94PeNppdfHTgtGHOuu', 0, '2025-04-08 21:22:01.800261', '2025-04-08 21:22:01.800261', 'Computer Science') RETURNING "id"
---
  def create
    @student = Student.new(student_params)

    if @student.save

SELECT "students".* FROM "students" WHERE "students"."id" = 980190963 LIMIT 1
SELECT "notifications".* FROM "notifications" WHERE "notifications"."student_id" = 980190963 ORDER BY "notifications"."created_at" DESC
---
  def notifications
    @student = Student.find(session[:student_id])
    @notifications = @student.notifications.order(created_at: :desc)

SELECT "notifications".* FROM "notifications" WHERE "notifications"."id" = 13 LIMIT 1
DELETE FROM "notifications" WHERE "notifications"."id" = 13
---
  def destroy_notification
    @notification = Notification.find_by(id: params[:id])

    # Ensure the notification belongs to the currently logged in student.
    if @notification && @notification.student_id == session[:student_id]
      @notification.destroy

UPDATE "students" SET "password_digest" = '$2a$12$u38SUf4mp8cBpUrRD4l1ReYUOtK9NBc9wtHoYUe7BtstHWnMS8JRu', "updated_at" = '2025-04-02 22:07:29.822982' WHERE "students"."id" = 980190963
---
  def update
    if @student.update(student_params)

SELECT "students".* FROM "students" WHERE "students"."id" = 980190963 LIMIT 1
---
  def edit_password
    @student = Student.find_by(id: session[:student_id])

SELECT "students".* FROM "students" WHERE "students"."id" = 980190963 LIMIT 1
UPDATE "students" SET "password_digest" = '$2a$12$u38SUf4mp8cBpUrRD4l1ReYUOtK9NBc9wtHoYUe7BtstHWnMS8JRu', "updated_at" = '2025-04-02 22:07:29.822982' WHERE "students"."id" = 980190963
---
  def update_password
    @student = Student.find_by(id: session[:student_id])
    return redirect_to dashboard_path, alert: "Student not found." unless @student

    if @student.authenticate(params[:student][:current_password])
      if @student.update(password_params)

SELECT "students".* FROM "students" WHERE "students"."id" = 980190963 LIMIT 1
---
  def set_student
    @student = Student.find_by(id: params[:id]) || Student.find_by(id: session[:student_id])