app/controllers/students_controller.rb

SELECT "students".* FROM "students"
---
  def index
    @students = Student.all

INSERT INTO "students" ("email", "name", "password_digest", "credits_earned", "created_at", "updated_at", "major", "notifications") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @student = Student.new(student_params)

    if @student.save

DELETE FROM "students" WHERE "students"."id" = ?  [["id", 980190962]]
---
  def destroy
    @student.destroy

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
  def set_student
    @student = Student.find_by(id: params[:id]) || Student.find_by(id: session[:student_id])