app/controllers/students_controller.rb

  def update
    if @student.update(student_params)
---
UPDATE "students" SET "email" = 'ca.caraballo123@yahoo.com', "updated_at" = '2025-04-02 23:37:10.065926' WHERE "students"."id" = 980190963

  def edit_password
    @student = Student.find_by(id: session[:student_id])
---
SELECT "students".* FROM "students" WHERE "students"."id" = 980190963 LIMIT 1

  def set_student
    @student = Student.find_by(id: params[:id]) || Student.find_by(id: session[:student_id])
---
SELECT "students".* FROM "students" WHERE "students"."id" = 980190963 LIMIT 1